; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=34, out_folder=htg/blocksworld/training, instance_id=14, seed=2038, goal_proportion=0.1

(define (problem blocksworld-14)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on b7 b32)
    (on b32 b24)
    (on b24 b21)
    (on b21 b16)
    (on b16 b22)
    (on b22 b3)
    (on b3 b23)
    (on b23 b28)
    (on-table b28)
    (clear b9)
    (on b9 b25)
    (on b25 b19)
    (on b19 b13)
    (on b13 b15)
    (on b15 b26)
    (on b26 b29)
    (on b29 b27)
    (on b27 b17)
    (on-table b17)
    (clear b14)
    (on-table b14)
    (clear b11)
    (on b11 b33)
    (on b33 b10)
    (on b10 b2)
    (on b2 b12)
    (on b12 b34)
    (on b34 b8)
    (on b8 b1)
    (on-table b1)
    (clear b20)
    (on b20 b30)
    (on b30 b18)
    (on b18 b4)
    (on b4 b5)
    (on b5 b31)
    (on b31 b6)
    (on-table b6))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b3)
    (on b3 b2)
    (on-table b2))))

; plan
1. (unstack b11 b33)
   deleted: (on b11 b33) (clear b11) (arm-empty)
   added: (holding b11) (clear b33)
   goals met: 1 of 5
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 5
3. (unstack b33 b10)
   deleted: (on b33 b10) (clear b33) (arm-empty)
   added: (holding b33) (clear b10)
   goals met: 1 of 5
4. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 1 of 5
5. (unstack b10 b2)
   deleted: (on b10 b2) (clear b10) (arm-empty)
   added: (holding b10) (clear b2)
   goals met: 1 of 5
6. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 5
7. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 1 of 5
8. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 5
9. (unstack b12 b34)
   deleted: (on b12 b34) (clear b12) (arm-empty)
   added: (holding b12) (clear b34)
   goals met: 2 of 5
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 5
11. (unstack b34 b8)
   deleted: (on b34 b8) (clear b34) (arm-empty)
   added: (holding b34) (clear b8)
   goals met: 2 of 5
12. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 2 of 5
13. (unstack b8 b1)
   deleted: (on b8 b1) (clear b8) (arm-empty)
   added: (holding b8) (clear b1)
   goals met: 3 of 5
14. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 5
15. (unstack b7 b32)
   deleted: (on b7 b32) (clear b7) (arm-empty)
   added: (holding b7) (clear b32)
   goals met: 3 of 5
16. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 5
17. (unstack b32 b24)
   deleted: (on b32 b24) (clear b32) (arm-empty)
   added: (holding b32) (clear b24)
   goals met: 3 of 5
18. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 3 of 5
19. (unstack b24 b21)
   deleted: (on b24 b21) (clear b24) (arm-empty)
   added: (holding b24) (clear b21)
   goals met: 3 of 5
20. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 5
21. (unstack b21 b16)
   deleted: (on b21 b16) (clear b21) (arm-empty)
   added: (holding b21) (clear b16)
   goals met: 3 of 5
22. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 3 of 5
23. (unstack b16 b22)
   deleted: (on b16 b22) (clear b16) (arm-empty)
   added: (holding b16) (clear b22)
   goals met: 3 of 5
24. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 3 of 5
25. (unstack b22 b3)
   deleted: (on b22 b3) (clear b22) (arm-empty)
   added: (holding b22) (clear b3)
   goals met: 4 of 5
26. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 5
27. (unstack b3 b23)
   deleted: (on b3 b23) (clear b3) (arm-empty)
   added: (holding b3) (clear b23)
   goals met: 3 of 5
28. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 5 of 5
